src/test/resources/soap/request/request-encryption-wss4j.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header>
        <wsse:Security
            xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
            xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
            SOAP-ENV:mustUnderstand="1">
            <wsse:BinarySecurityToken
                EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"
                ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"
                wsu:Id="F6AB7B2EED9C4329C114579722239702">MIICuTCCAiKgAwIBAgIEpKr1wzANBgkqhkiG9w0BAQsFADBtMRkwFwYDVQQDDBB3d3cud2FuZHJlbGwuY29tMREwDwYDVQQKDAhXYW5kcmVsbDENMAsGA1UECwwETm9uZTEPMA0GA1UEBwwGTG9uZG9uMRAwDgYDVQQIDAdFbmdsYW5kMQswCQYDVQQGEwJVSzAgFw0xNTAxMTgxMDMzMjZaGA8yMTE1MTIyNTEwMzMyNlowbTEZMBcGA1UEAwwQd3d3LndhbmRyZWxsLmNvbTERMA8GA1UECgwIV2FuZHJlbGwxDTALBgNVBAsMBE5vbmUxDzANBgNVBAcMBkxvbmRvbjEQMA4GA1UECAwHRW5nbGFuZDELMAkGA1UEBhMCVUswgZ8wDQYJKoZIhvcNAQEBBQADgY0AMIGJAoGBANJbrAGXELybayKT+YSvDoZavjGDaj3Gf8Tqg7tukXPKxANAWMQ7RqSm7ufXY0DQFVA37VALvpd9/Yx789rEFWAGOw58vMyFlUbv5YFoaJT+e5SZIj87sbMYHRQzm9SpCOYpt2rtXnhxbv6+bsAb44i3FefTyRVQunq2z5KUWTNhAgMBAAGjZDBiMB0GA1UdDgQWBBQySQfgyZef8ah0y6RT7EL3KYN7gTAPBgNVHRMBAf8EBTADAQH/MAsGA1UdDwQEAwIBtjAjBgNVHSUEHDAaBggrBgEFBQcDAQYIKwYBBQUHAwIGBFUdJQAwDQYJKoZIhvcNAQELBQADgYEAOkjnr94UEyclOCh07lIh24+EIkerGKLPfAGS4vqdWDLVjh9kxi9P5UCGpboL+HYPOK8b6tkLETgM1wwK/U5ISDe9FrevibFBirFGy9DRUPVJQ+UTL+oQSmTi/BM3duwS76sSZK2rHsSBF4kRMOM8F05NWY8yd9QJTXZykFE7SnY=
            </wsse:BinarySecurityToken>
            <xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
                Id="EK-F6AB7B2EED9C4329C114579722239681">
                <xenc:EncryptionMethod
                    Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p" />
                <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                    <wsse:SecurityTokenReference>
                        <wsse:Reference URI="#F6AB7B2EED9C4329C114579722239702"
                            ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" />
                    </wsse:SecurityTokenReference>
                </ds:KeyInfo>
                <xenc:CipherData>
                    <xenc:CipherValue>T9sZPpvBAMkGx39/OGoFPOMtgw3v+1+HFAxqXYNinEokeYfqWY5+8Z2qTLRrZgqPUP1yVt2AVnqyMDLhR/pkBEzXuJqisgVNJxoXTc9nIBpPBuhWv909pDQ+Y0wkuua/auaXRE+g43fTrnHeKkvi95TSCNNhnKjpM9U5BDcugYs=
                    </xenc:CipherValue>
                </xenc:CipherData>
                <xenc:ReferenceList>
                    <xenc:DataReference URI="#ED-F6AB7B2EED9C4329C114579722239903" />
                </xenc:ReferenceList>
            </xenc:EncryptedKey>
        </wsse:Security>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
            Id="ED-F6AB7B2EED9C4329C114579722239903" Type="http://www.w3.org/2001/04/xmlenc#Content">
            <xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc" />
            <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                <wsse:SecurityTokenReference
                    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                    xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
                    wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey">
                    <wsse:Reference URI="#EK-F6AB7B2EED9C4329C114579722239681" />
                </wsse:SecurityTokenReference>
            </ds:KeyInfo>
            <xenc:CipherData>
                <xenc:CipherValue>u+AB/zj6LnYe+jAsmOVmSF+pEmFz4YDNoQ0ZyCXeXzaen8CAUjL+IlCa5oL1wXZg+TrfK69b5HndP9NOFw5TfJCZEnaPdplYGd7+qHPom9tkXLIa0k5/bMGoMWjJBlBX4WRBfQl6HGfgZ1FxM9ib9CcqtlQAnu9uWmRG6CpXc0aIWaQzfZBk4RxMaooOMEhr
                </xenc:CipherValue>
            </xenc:CipherData>
        </xenc:EncryptedData>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>